{
  "users": [
    {
      "id": 1,
      "fullName": "Juan Pérez",
      "email": "juan.perez@example.com",
      "phone": "987654321",
      "document": "00000000",
      "password": "juan123",
      "profileImg": "https://randomuser.me/api/portraits/med/men/48.jpg",
      "role": "tutor"
    },
    {
      "id": 2,
      "fullName": "María López",
      "email": "maria.lopez",
      "phone": "987654322",
      "document": "00000001",
      "password": "maria123",
      "profileImg": "https://randomuser.me/api/portraits/med/women/49.jpg",
      "role": "caregiver"
    }
  ],
  "services": [
    {
      "id": 1,
      "caregiverId": 2,
      "description": "Don't worry, I'll take care of your loved one with the utmost dedication and care. I understand the importance of providing a safe and nurturing environment, and I am committed to ensuring that your loved one feels comfortable and well-cared for at all times. My approach is centered on empathy, patience, and a genuine passion for caregiving. I strive to create a positive and supportive atmosphere where your loved one can thrive and feel valued. Whether it's through engaging activities, attentive care, or simply being a comforting presence, I am here to provide the best possible care for your loved one.",
      "schedule": [
        {
          "day": "mon",
          "workHours": { "startTime": "08:00", "endTime": "16:00" }
        },
        {
          "day": "tue",
          "workHours": { "startTime": "08:00", "endTime": "16:00" }
        },
        {
          "day": "thu",
          "workHours": { "startTime": "08:00", "endTime": "16:00" }
        },
        {
          "day": "fri",
          "workHours": { "startTime": "08:00", "endTime": "12:00" }
        }
      ],
      "workaround": ["San Miguel", "Magdalena", "Surquillo", "San Isidro"],
      "farePerHour": 3.2
    }
  ],
  "reservations": [
    {
      "id": 1,
      "tutorId": 1,
      "caregiverId": 2,
      "status": "pending",
      "schedule": {
        "date": "2021-12-03",
        "startTime": "08:00",
        "endTime": "12:00"
      },
      "totalFare": 30.0,
      "createdAt": "2024-08-11"
    }
  ],
  "payments": [
    {
      "id": 1,
      "userId": 1,
      "reservationId": 1,
      "userPaymentMethodId": 1,
      "amount": 30.0,
      "operation": "payment",
      "createdAt": "2024-08-11"
    },
    {
      "id": 2,
      "userId": 2,
      "reservationId": 1,
      "userPaymentMethodId": 2,
      "amount": 30.0,
      "operation": "retrieve",
      "createdAt": "2024-08-11"
    }
  ],
  "userPaymentMethods": [
    {
      "id": 1,
      "userId": 1,
      "cardNumber": "1234567890123456",
      "expirationDate": "12/24",
      "cvv": "123",
      "cardHolder": "Juan Pérez"
    },
    {
      "id": 2,
      "userId": 1,
      "cardNumber": "8888888888888888",
      "expirationDate": "12/25",
      "cvv": "999",
      "cardHolder": "Juan Pérez Francisco"
    },
    {
      "id": 3,
      "userId": 2,
      "cardNumber": "1234567890123456",
      "expirationDate": "12/24",
      "cvv": "123",
      "cardHolder": "María López"
    }
  ],

  "search-caregivers": [
    {
      "id": 1,
      "fullName": "Juan Pérez",
      "image": "https://randomuser.me/api/portraits/med/men/48.jpg",
      "address": "Surquillo",
      "description": "Don't worry, I'll take care of your loved one.",
      "rate": 4.4,
      "serviceDescription": {
        "biography": "Hi, I’m Juan Pérez, and I bring over a decade of experience in childcare to the table. My passion for working with children drives me to create safe, nurturing, and stimulating environments where kids can thrive. I’ve had the privilege of working with children of all ages, from infants to pre-teens, and I pride myself on my ability to cater to their individual developmental needs. In my career, I’ve managed diverse groups of children in both private and public settings, designing structured yet flexible schedules that support their growth. I enjoy creating engaging, age-appropriate activities that promote social, emotional, and cognitive development, helping each child reach their full potential. I believe in the importance of open communication with parents to ensure that their expectations are met and that their children are happy and well-cared for. My approach is rooted in patience, empathy, and a genuine love for children. I am committed to continuous learning and professional development to stay updated with the latest childcare practices and techniques. I am also trained in first aid and emergency response, ensuring that I can handle any situation that may arise. My goal is to provide a safe, fun, and educational environment where children can grow and thrive.",
        "schedule": ["mon", "tue", "wed", "thu", "fri"],
        "workHours": {
          "startTime": "08:00",
          "endTime": "16:00"
        },
        "farePerHour": 5.9,
        "workaround": ["San Miguel", "Magdalena", "Surquillo", "San Isidro"]
      }
    },
    {
      "id": 2,
      "fullName": "María López",
      "image": "https://randomuser.me/api/portraits/med/women/49.jpg",
      "address": "San Isidro",
      "description": "Caring and experienced caregiver.",
      "rate": 4.5,
      "serviceDescription": {
        "biography": "Hello, I’m María López, and I have been a dedicated caregiver for over seven years. My journey in this field began with a passion for helping children grow and develop in a safe and nurturing environment. I have experience working with children of all ages, from infants to teenagers, and I am skilled at creating engaging and educational activities that promote their development. I believe in the importance of open communication with parents to ensure that their expectations are met and that their children are happy and well-cared for. My approach is centered on patience, empathy, and a genuine love for children. I am committed to continuous learning and regularly attend workshops and training sessions to stay updated with the latest childcare practices. My training includes first aid and CPR, ensuring that I am prepared to handle any emergencies that may arise. My goal is to provide a loving and supportive environment where children can thrive and reach their full potential.",
        "schedule": ["mon", "tue", "wed", "thu", "fri"],
        "workHours": {
          "startTime": "09:00",
          "endTime": "17:00"
        },
        "farePerHour": 6.2,
        "workaround": ["San Isidro", "Miraflores", "Surco", "San Borja"]
      }
    },
    {
      "id": 3,
      "fullName": "Carlos García",
      "image": "https://randomuser.me/api/portraits/med/men/50.jpg",
      "address": "La Molina",
      "description": "Reliable and trustworthy caregiver.",
      "rate": 4.6,
      "serviceDescription": {
        "biography": "Hi, I’m Carlos García, and I have been a professional caregiver for over eight years. My passion for working with children drives me to create safe, nurturing, and stimulating environments where kids can thrive. I have experience working with children of all ages, from infants to teenagers, and I am skilled at creating engaging and educational activities that promote their development. I believe in the importance of open communication with parents to ensure that their expectations are met and that their children are happy and well-cared for. My approach is centered on patience, empathy, and a genuine love for children. I am committed to continuous learning and regularly attend workshops and training sessions to stay updated with the latest childcare practices. My training includes first aid and CPR, ensuring that I am prepared to handle any emergencies that may arise. My goal is to provide a loving and supportive environment where children can thrive and reach their full potential.",
        "schedule": ["mon", "tue", "wed", "thu", "fri"],
        "workHours": {
          "startTime": "07:00",
          "endTime": "15:00"
        },
        "farePerHour": 6,
        "workaround": ["La Molina", "Surco", "San Borja", "San Isidro"]
      }
    },
    {
      "id": 4,
      "fullName": "Ana Martínez",
      "image": "https://randomuser.me/api/portraits/med/women/51.jpg",
      "address": "San Borja",
      "description": "Experienced caregiver with a gentle touch.",
      "rate": 4.7,
      "serviceDescription": {
        "biography": "Hello, I’m Ana Martínez, and I have been dedicated to providing exceptional childcare for over eight years. My journey in this field began with a deep-seated love for children and a desire to contribute positively to their development. Throughout my career, I have worked with children of various ages, from newborns to teenagers, and have developed a keen understanding of their unique needs and behaviors. I am adept at creating a safe and nurturing environment where children feel valued and supported. My approach is centered on fostering a positive and stimulating atmosphere that encourages learning and growth. I believe in the power of play as a tool for development and incorporate educational activities into daily routines. I am committed to maintaining open lines of communication with parents to ensure that their expectations are met and that their children are thriving. My training includes first aid and CPR, ensuring that I am prepared to handle any emergencies that may arise. I am passionate about continuous learning and regularly attend workshops and training sessions to stay updated with the latest childcare practices. My goal is to provide a loving and supportive environment where children can flourish and reach their full potential.",
        "schedule": ["mon", "tue", "wed", "thu", "fri"],
        "workHours": {
          "startTime": "09:00",
          "endTime": "17:00"
        },
        "farePerHour": 6.5,
        "workaround": ["San Borja", "La Molina", "Surco", "San Isidro"]
      }
    },
    {
      "id": 5,
      "fullName": "Luis Fernández",
      "image": "https://randomuser.me/api/portraits/med/men/52.jpg",
      "address": "Miraflores",
      "description": "Compassionate and reliable caregiver.",
      "rate": 4.6,
      "serviceDescription": {
        "biography": "Hi, I’m Luis Fernández, and I have been a dedicated caregiver for over ten years. My journey in this field began with a passion for helping others and a desire to make a positive impact on the lives of children and their families. I have extensive experience working with children of all ages, from infants to teenagers, and I am skilled at creating a safe and nurturing environment where they can thrive. My approach is centered on building strong, trusting relationships with both children and their parents. I believe in the importance of open communication and work closely with parents to ensure that their expectations are met and that their children are happy and well-cared for. I am committed to continuous learning and regularly attend workshops and training sessions to stay updated with the latest childcare practices. My training includes first aid and CPR, ensuring that I am prepared to handle any emergencies that may arise. I am passionate about creating engaging, age-appropriate activities that promote social, emotional, and cognitive development. My goal is to provide a loving and supportive environment where children can grow and reach their full potential.",
        "schedule": ["mon", "tue", "wed", "thu", "fri"],
        "workHours": {
          "startTime": "07:00",
          "endTime": "15:00"
        },
        "farePerHour": 6,
        "workaround": ["Miraflores", "Barranco", "San Isidro", "Surco"]
      }
    },
    {
      "id": 22,
      "fullName": "Andrea Torres",
      "image": "https://randomuser.me/api/portraits/med/women/58.jpg",
      "address": "San Borja",
      "description": "Experienced caregiver with a gentle touch.",
      "rate": 4.7,
      "serviceDescription": {
        "biography": "Hello, I’m Andrea Torres, and I have been dedicated to providing exceptional childcare for over eight years. My journey in this field began with a deep-seated love for children and a desire to contribute positively to their development. Throughout my career, I have worked with children of various ages, from newborns to teenagers, and have developed a keen understanding of their unique needs and behaviors. I am adept at creating a safe and nurturing environment where children feel valued and supported. My approach is centered on fostering a positive and stimulating atmosphere that encourages learning and growth. I believe in the power of play as a tool for development and incorporate educational activities into daily routines. I am committed to maintaining open lines of communication with parents to ensure that their expectations are met and that their children are thriving. My training includes first aid and CPR, ensuring that I am prepared to handle any emergencies that may arise. I am passionate about continuous learning and regularly attend workshops and training sessions to stay updated with the latest childcare practices. My goal is to provide a loving and supportive environment where children can flourish and reach their full potential.",
        "schedule": ["mon", "tue", "wed", "thu", "fri"],
        "workHours": {
          "startTime": "09:00",
          "endTime": "17:00"
        },
        "farePerHour": 6.5,
        "workaround": ["San Borja", "La Molina", "Surco", "San Isidro"]
      }
    },
    {
      "id": 23,
      "fullName": "Roberto Castillo",
      "image": "https://randomuser.me/api/portraits/med/men/59.jpg",
      "address": "Miraflores",
      "description": "Compassionate and reliable caregiver.",
      "rate": 4.6,
      "serviceDescription": {
        "biography": "Hi, I’m Roberto Castillo, and I have been a dedicated caregiver for over ten years. My journey in this field began with a passion for helping others and a desire to make a positive impact on the lives of children and their families. I have extensive experience working with children of all ages, from infants to teenagers, and I am skilled at creating a safe and nurturing environment where they can thrive. My approach is centered on building strong, trusting relationships with both children and their parents. I believe in the importance of open communication and work closely with parents to ensure that their expectations are met and that their children are happy and well-cared for. I am committed to continuous learning and regularly attend workshops and training sessions to stay updated with the latest childcare practices. My training includes first aid and CPR, ensuring that I am prepared to handle any emergencies that may arise. I am passionate about creating engaging, age-appropriate activities that promote social, emotional, and cognitive development. My goal is to provide a loving and supportive environment where children can grow and reach their full potential.",
        "schedule": ["mon", "tue", "wed", "thu", "fri"],
        "workHours": {
          "startTime": "07:00",
          "endTime": "15:00"
        },
        "farePerHour": 6,
        "workaround": ["Miraflores", "Barranco", "San Isidro", "Surco"]
      }
    }
  ],

  "reservationsV2": [
    {
      "userId": 1,
      "search-caregiverId": 1,
      "date": "2021-12-01",
      "startTime": "08:00",
      "endTime": "12:00",
      "totalFare": 30.0,
      "location": "Surquillo"
    },
    {
      "userId": 2,
      "search-caregiverId": 2,
      "date": "2021-12-02",
      "startTime": "09:00",
      "endTime": "13:00",
      "totalFare": 32.0,
      "location": "San Isidro"
    },
    {
      "userId": 3,
      "search-caregiverId": 3,
      "date": "2021-12-03",
      "startTime": "07:00",
      "endTime": "11:00",
      "totalFare": 28.0,
      "location": "La Molina"
    },
    {
      "userId": 4,
      "search-caregiverId": 4,
      "date": "2021-12-04",
      "startTime": "09:00",
      "endTime": "13:00",
      "totalFare": 34.0,
      "location": "San Borja"
    },
    {
      "userId": 5,
      "search-caregiverId": 5,
      "date": "2021-12-05",
      "startTime": "07:00",
      "endTime": "11:00",
      "totalFare": 30.0,
      "location": "Miraflores"
    },
    {
      "userId": 6,
      "search-caregiverId": 1,
      "date": "2021-12-06",
      "startTime": "08:00",
      "endTime": "12:00",
      "totalFare": 30.0,
      "location": "Surquillo"
    },
    {
      "userId": 7,
      "search-caregiverId": 2,
      "date": "2021-12-07",
      "startTime": "09:00",
      "endTime": "13:00",
      "totalFare": 32.0,
      "location": "San Isidro"
    },
    {
      "userId": 8,
      "search-caregiverId": 3,
      "date": "2021-12-08",
      "startTime": "07:00",
      "endTime": "11:00",
      "totalFare": 28.0,
      "location": "La Molina"
    },
    {
      "userId": 9,
      "search-caregiverId": 4,
      "date": "2021-12-09",
      "startTime": "09:00",
      "endTime": "13:00",
      "totalFare": 34.0,
      "location": "San Borja"
    },
    {
      "userId": 10,
      "search-caregiverId": 5,
      "date": "2021-12-10",
      "startTime": "07:00",
      "endTime": "11:00",
      "totalFare": 30.0,
      "location": "Miraflores"
    },
    {
      "userId": 1,
      "search-caregiverId": 2,
      "date": "2021-12-11",
      "startTime": "08:00",
      "endTime": "12:00",
      "totalFare": 32.0,
      "location": "San Isidro"
    },
    {
      "userId": 2,
      "search-caregiverId": 3,
      "date": "2021-12-12",
      "startTime": "09:00",
      "endTime": "13:00",
      "totalFare": 28.0,
      "location": "La Molina"
    },
    {
      "userId": 3,
      "search-caregiverId": 4,
      "date": "2021-12-13",
      "startTime": "07:00",
      "endTime": "11:00",
      "totalFare": 34.0,
      "location": "San Borja"
    },
    {
      "userId": 4,
      "search-caregiverId": 5,
      "date": "2021-12-14",
      "startTime": "09:00",
      "endTime": "13:00",
      "totalFare": 30.0,
      "location": "Miraflores"
    },
    {
      "userId": 5,
      "search-caregiverId": 1,
      "date": "2021-12-15",
      "startTime": "07:00",
      "endTime": "11:00",
      "totalFare": 30.0,
      "location": "Surquillo"
    },
    {
      "userId": 6,
      "search-caregiverId": 2,
      "date": "2021-12-16",
      "startTime": "08:00",
      "endTime": "12:00",
      "totalFare": 32.0,
      "location": "San Isidro"
    },
    {
      "userId": 7,
      "search-caregiverId": 3,
      "date": "2021-12-17",
      "startTime": "09:00",
      "endTime": "13:00",
      "totalFare": 28.0,
      "location": "La Molina"
    },
    {
      "userId": 8,
      "search-caregiverId": 4,
      "date": "2021-12-18",
      "startTime": "07:00",
      "endTime": "11:00",
      "totalFare": 34.0,
      "location": "San Borja"
    },
    {
      "userId": 9,
      "search-caregiverId": 5,
      "date": "2021-12-19",
      "startTime": "09:00",
      "endTime": "13:00",
      "totalFare": 30.0,
      "location": "Miraflores"
    },
    {
      "userId": 10,
      "search-caregiverId": 1,
      "date": "2021-12-20",
      "startTime": "08:00",
      "endTime": "12:00",
      "totalFare": 30.0,
      "location": "Surquillo"
    }
  ]
}
